In [286]:
import numpy as np
import pandas as pd

In [287]:
df = pd.read_excel('UUCF Assignment Spreadsheet.xls')

In [288]:
df.columns

Index(['Unnamed: 0',         1648,         5136,          918,         2824,
               3867,          860,         3712,         2968,         3525,
               4323,         3617,         4360,         2756,           89,
                442,         3556,         5261,         2492,         5062,
               2486,         4942,         2267,         4809,         3853,
               2288],
      dtype='object')

In [289]:
movie_id = []
movie_title = []
for title in df['Unnamed: 0']:
    t = title.split(':')
    movie_id.append(t[0])
    movie_title.append(t[1])

In [290]:
df['Movie_Id'] = movie_id
df['Movie_title'] = movie_title

In [291]:
df.drop(columns = 'Unnamed: 0', inplace = True)

In [292]:
df.head()

,1648,5136,918,2824,3867,860,3712,2968,3525,4323,...,2492,5062,2486,4942,2267,4809,3853,2288,Movie_Id,Movie_title
0,NaN,4.5,5.0,4.5,4.0,4.0,NaN,5.0,4.0,5.0,...,4.5,4.0,3.5,NaN,NaN,NaN,NaN,NaN,11,Star Wars
1,NaN,5.0,5.0,NaN,4.0,4.0,4.5,4.5,4.0,5.0,...,3.5,4.0,2.0,3.5,NaN,NaN,NaN,3.5,12,Finding Nemo (2003)
2,NaN,5.0,4.5,5.0,4.5,4.5,NaN,5.0,4.5,5.0,...,3.5,4.5,4.5,4.0,3.5,4.5,3.5,3.5,13,Forrest Gump (1994)
3,NaN,4.0,NaN,NaN,NaN,NaN,4.5,2.0,3.5,5.0,...,3.5,4.5,3.5,4.0,NaN,3.5,NaN,NaN,14,American Beauty (1999)
4,4.0,5.0,3.0,4.5,4.0,2.5,NaN,5.0,3.0,4.0,...,4.0,4.0,2.5,3.5,NaN,5.0,NaN,3.5,22,Pirates of the Caribbean

In [293]:
df1 = df.corr()
df1.head()

,1648,5136,918,2824,3867,860,3712,2968,3525,4323,...,3556,5261,2492,5062,2486,4942,2267,4809,3853,2288
1648,1.000000,0.402980,-0.142206,0.517620,0.300200,0.480537,-0.312412,0.383348,0.092775,0.098191,...,-0.191988,0.493008,0.360644,0.551089,0.002544,0.116653,-0.429183,0.394371,-0.304422,0.245048
5136,0.402980,1.000000,0.118979,0.057916,0.341734,0.241377,0.131398,0.206695,0.360056,0.033642,...,0.488607,0.328120,0.422236,0.226635,0.305803,0.037769,0.240728,0.411676,0.189234,0.390067
918,-0.142206,0.118979,1.000000,-0.317063,0.294558,0.468333,0.092037,-0.045854,0.367568,-0.035394,...,0.373226,0.470972,0.069956,-0.054762,0.133812,0.015169,-0.273096,0.082528,0.667168,0.119162
2824,0.517620,0.057916,-0.317063,1.000000,-0.060913,-0.008066,0.462910,0.214760,0.169907,0.119350,...,-0.201275,0.228341,0.238700,0.259660,0.247097,0.149247,-0.361466,0.474974,-0.262073,0.166999
3867,0.300200,0.341734,0.294558,-0.060913,1.000000,0.282497,0.400275,0.264249,0.125193,-0.333602,...,0.174085,0.297977,0.476683,0.293868,0.438992,-0.162818,-0.295966,0.054518,0.464110,0.379856

In [294]:
weight =df1[3867].sort_values(ascending = False).head(6) 
weight.drop(3867, inplace = True)
weight_values = []
for value in weight:
    weight_values.append(value)
weight_values

[0.4766832805451799,
 0.46411014776485643,
 0.4389915544146359,
 0.4002745042538168,
 0.37985626502293035]

In [295]:
df_neighbor = df[[2492,3853,2486,3712,2288,'Movie_Id', 'Movie_title']]

In [296]:
# score = sum(Rn*Wo)/sum(Wo)

In [297]:
df_neighbor.fillna(0, inplace = True)

C:\Users\alina\anaconda3\lib\site-packages\pandas\core\frame.py:4462: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().fillna(

In [298]:
df_neighbor_rates= df_neighbor[[2492,3853,2486,3712,2288]]
df_neighbor_rates.head(3)

   2492  3853  2486  3712  2288
0   4.5   0.0   3.5   0.0   0.0
1   3.5   0.0   2.0   4.5   3.5
2   3.5   3.5   4.5   0.0   3.5

In [299]:
sum_of_weights = []
for j in range(100):
    l = list(df_neighbor_rates.iloc[j])
    nonzero_values_indices = [idx for idx, val in enumerate(l) if val != 0]
    count =[]
    for i in nonzero_values_indices:
        count.append(weight_values[i])
    
    sum_weight = 0
    
    for j in count:
        sum_weight = sum_weight + j
    sum_of_weights.append(sum_weight)

In [300]:
# 
def average_score(data):
    score= []
    for row in range(100):
        score.append((df_neighbor_rates.iloc[row]*weight_values).sum()/sum_of_weights[row])
    return score

In [301]:
df_neighbor['Final_Score'] = average_score(df_neighbor_rates)

<ipython-input-301-d7c119474917>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_neighbor['Final_Score'] = average_score(df_neighbor_rates)

In [302]:
df_neighbor.head()

,2492,3853,2486,3712,2288,Movie_Id,Movie_title,Final_Score
0,4.5,0.0,3.5,0.0,0.0,11,Star Wars,4.020581
1,3.5,0.0,2.0,4.5,3.5,12,Finding Nemo (2003),3.347734
2,3.5,3.5,4.5,0.0,3.5,13,Forrest Gump (1994),3.749478
3,3.5,0.0,3.5,4.5,0.0,14,American Beauty (1999),3.804172
4,4.0,0.0,2.5,0.0,3.5,22,Pirates of the Caribbean,3.345121

In [303]:
df_neighbor.sort_values(by = 'Final_Score', ascending = False).head(10)

,2492,3853,2486,3712,2288,Movie_Id,Movie_title,Final_Score
77,5.0,0.0,4.5,0.0,0.0,1891,Star Wars,4.760291
21,5.0,5.0,4.5,0.0,3.5,155,The Dark Knight (2008),4.551454
16,5.0,4.0,4.5,5.0,4.0,122,The Lord of the Rings,4.507637
8,4.0,4.5,4.5,0.0,5.0,77,Memento (2000),4.472487
15,4.0,5.0,4.0,5.0,4.0,121,The Lord of the Rings,4.400194
50,4.0,4.5,4.5,5.0,4.0,603,The Matrix (1999),4.394379
46,4.0,0.0,3.5,5.0,5.0,585,Monsters Inc. (2001),4.330601
64,0.0,4.0,4.5,0.0,4.5,807,Seven (a.k.a. Se7en) (1995),4.319125
14,3.5,5.0,4.0,5.0,4.0,120,The Lord of the Rings,4.289846
27,0.0,5.0,3.0,4.0,5.0,238,The Godfather (1972),4.240594

In [304]:
df[[3867, 'Movie_title']].sort_values(by = 3867, ascending = False).head(20)

    3867                                        Movie_title
74   5.0                                           Die Hard
14   5.0                              The Lord of the Rings
50   5.0                                  The Matrix (1999)
59   5.0                                Pulp Fiction (1994)
16   5.0                              The Lord of the Rings
15   5.0                              The Lord of the Rings
21   5.0                             The Dark Knight (2008)
61   5.0                              V for Vendetta (2006)
65   5.0                                       Shrek (2001)
9    4.5   Raiders of the Lost Ark (Indiana Jones and th...
77   4.5                                          Star Wars
41   4.5                                  Fight Club (1999)
58   4.5     Harry Potter and the Chamber of Secrets (2002)
2    4.5                                Forrest Gump (1994)
60   4.0                             The Sixth Sense (1999)
57   4.0   Harry Potter and the Sorcerer's Stone (a.k.a....
54   4.0                         Catch Me If You Can (2002)
52   4.0                   Men in Black (a.k.a. MIB) (1997)
1    4.0                                Finding Nemo (2003)
78   4.0                                          Star Wars

In [305]:
# Top Recommendation Movies for user 3712 without normalization
df.head()

,1648,5136,918,2824,3867,860,3712,2968,3525,4323,...,2492,5062,2486,4942,2267,4809,3853,2288,Movie_Id,Movie_title
0,NaN,4.5,5.0,4.5,4.0,4.0,NaN,5.0,4.0,5.0,...,4.5,4.0,3.5,NaN,NaN,NaN,NaN,NaN,11,Star Wars
1,NaN,5.0,5.0,NaN,4.0,4.0,4.5,4.5,4.0,5.0,...,3.5,4.0,2.0,3.5,NaN,NaN,NaN,3.5,12,Finding Nemo (2003)
2,NaN,5.0,4.5,5.0,4.5,4.5,NaN,5.0,4.5,5.0,...,3.5,4.5,4.5,4.0,3.5,4.5,3.5,3.5,13,Forrest Gump (1994)
3,NaN,4.0,NaN,NaN,NaN,NaN,4.5,2.0,3.5,5.0,...,3.5,4.5,3.5,4.0,NaN,3.5,NaN,NaN,14,American Beauty (1999)
4,4.0,5.0,3.0,4.5,4.0,2.5,NaN,5.0,3.0,4.0,...,4.0,4.0,2.5,3.5,NaN,5.0,NaN,3.5,22,Pirates of the Caribbean

In [306]:
neighbor_of_3712 = df.corr()[3712].sort_values(ascending = False).head(6) # top 5 neighbors
neighbor_of_3712

3712    1.000000
2824    0.462910
3867    0.400275
5062    0.247693
442     0.227130
3853    0.193660
Name: 3712, dtype: float64

In [307]:
weights_3712 = list(neighbor_of_3712)

In [308]:
weights_3712.remove(1)

In [309]:
weights_3712

[0.46291004988627577,
 0.4002745042538168,
 0.24769327229404733,
 0.22712986493078843,
 0.1936596018372691]

In [373]:
norm.iloc[0]

2824    0.574989
3867    0.511101
5062    0.511101
442     0.383326
3853    0.000000
Name: 0, dtype: float64

In [310]:
df_3712 = df[[2824, 3867, 5062,442, 3853, 'Movie_Id', 'Movie_title']]

In [311]:
df_3712

    2824  3867  5062  442  3853 Movie_Id                   Movie_title
0    4.5   4.0   4.0  3.0   NaN       11                     Star Wars
1    NaN   4.0   4.0  NaN   NaN       12           Finding Nemo (2003)
2    5.0   4.5   4.5  3.0   3.5       13           Forrest Gump (1994)
3    NaN   NaN   4.5  4.0   NaN       14        American Beauty (1999)
4    4.5   4.0   4.0  1.0   NaN       22      Pirates of the Caribbean
..   ...   ...   ...  ...   ...      ...                           ...
95   NaN   3.0   3.5  NaN   NaN     9806        The Incredibles (2004)
96   NaN   4.0   2.0  NaN   NaN    10020   Beauty and the Beast (1991)
97   NaN   4.0   4.0  4.0   3.0    36657                  X-Men (2000)
98   NaN   3.5   NaN  4.0   NaN    36658                            X2
99   NaN   3.0   NaN  NaN   NaN    36955              True Lies (1994)

[100 rows x 7 columns]

In [312]:
df_3712_rates = df_3712[[2824, 3867,5062,442,3853]]

In [313]:
df_3712_rates.fillna(0, inplace = True)

C:\Users\alina\anaconda3\lib\site-packages\pandas\core\frame.py:4462: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().fillna(

In [314]:
sum_weights_3712 = []
for j in range(100):
    l = list(df_3712_rates.iloc[j])
    nonzero_values_indices = [idx for idx, val in enumerate(l) if val != 0]
    count =[]
    for i in nonzero_values_indices:
        count.append(weights_3712[i])
    
    sum_weight = 0
    
    for j in count:
        sum_weight = sum_weight + j
    sum_weights_3712.append(sum_weight)

In [315]:
sum_weights_3712

[1.3380076913649284,
 0.6479677765478641,
 1.5316672932021975,
 0.47482313722483577,
 1.3380076913649284,
 1.5316672932021975,
 0.6684827390621049,
 0.4207894667680575,
 1.1313927889483806,
 1.0687572433159216,
 1.5316672932021975,
 0.47482313722483577,
 0.7106033221803231,
 0.4002745042538168,
 1.5316672932021975,
 1.5316672932021975,
 1.5316672932021975,
 0.24769327229404733,
 0.6684827390621049,
 0.24769327229404733,
 0.6684827390621049,
 1.5316672932021975,
 0.8416273783851331,
 1.5316672932021975,
 0.47482313722483577,
 0.6684827390621049,
 0.4207894667680575,
 0.8210639710218743,
 0.24769327229404733,
 0.6274043691846052,
 1.28397402090815,
 0.4207894667680575,
 0,
 1.304537428271409,
 1.0687572433159216,
 1.0687572433159216,
 1.5316672932021975,
 0.6274043691846052,
 0.4207894667680575,
 1.5316672932021975,
 0.4002745042538168,
 1.3380076913649284,
 0.6274043691846052,
 0.8750976414786525,
 0.47482313722483577,
 0,
 0.6479677765478641,
 0.8750976414786525,
 0.6479677765478641,
 1.0687572433159216,
 1.5316672932021975,
 1.5316672932021975,
 1.5316672932021975,
 0.4413528741313164,
 1.11087782643414,
 0.22712986493078843,
 0.24769327229404733,
 1.3380076913649284,
 1.3380076913649284,
 1.5316672932021975,
 0.8210639710218743,
 1.28397402090815,
 0,
 0.8416273783851331,
 0.8836995166543333,
 1.5316672932021975,
 1.090314419070881,
 1.11087782643414,
 1.0687572433159216,
 0.8210639710218743,
 0.6479677765478641,
 0.6684827390621049,
 0.6684827390621049,
 1.090314419070881,
 0.8750976414786525,
 0.6479677765478641,
 0.6479677765478641,
 1.3380076913649284,
 1.3380076913649284,
 1.3380076913649284,
 0.4207894667680575,
 0.22712986493078843,
 0.4207894667680575,
 0.8750976414786525,
 0.8750976414786525,
 0.6274043691846052,
 0.6479677765478641,
 0.1936596018372691,
 0.47482313722483577,
 0.22712986493078843,
 0.6479677765478641,
 1.090314419070881,
 0,
 0,
 0.22712986493078843,
 0.6479677765478641,
 0.6479677765478641,
 1.0687572433159216,
 0.6274043691846052,
 0.4002745042538168]

In [316]:
def average_score(data):
    score_3712 = []
    for row in range(100):
        score_3712.append((df_3712_rates.iloc[row]*weights_3712).sum()/sum_weights_3712[row])
    return score_3712

In [317]:
df_3712['Final_Score']= average_score(df_3712_rates)

<ipython-input-316-71aa9b02a2ea>:4: RuntimeWarning: invalid value encountered in double_scalars
  score_3712.append((df_3712_rates.iloc[row]*weights_3712).sum()/sum_weights_3712[row])
<ipython-input-317-00c0a70b5b70>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_3712['Final_Score']= average_score(df_3712_rates)

In [318]:
df_3712.sort_values(by= 'Final_Score', ascending = False ).head(3)

,2824,3867,5062,442,3853,Movie_Id,Movie_title,Final_Score
55,NaN,NaN,NaN,5.0,NaN,641,Requiem for a Dream (2000),5.000000
50,5.0,5.0,4.5,5.0,4.5,603,The Matrix (1999),4.855924
11,NaN,NaN,4.5,5.0,NaN,105,Back to the Future (1985),4.739173

In [319]:
df[[3712, 'Movie_title']].sort_values(by = 3712, ascending = False).head(3)

    3712               Movie_title
38   5.0   Schindler's List (1993)
26   5.0         Braveheart (1995)
75   5.0   Meet the Parents (2000)

## Score With Normalization

In [320]:
df_3712_rates.head()

   2824  3867  5062  442   3853
0   4.5   4.0   4.0   3.0   0.0
1   0.0   4.0   4.0   0.0   0.0
2   5.0   4.5   4.5   3.0   3.5
3   0.0   0.0   4.5   4.0   0.0
4   4.5   4.0   4.0   1.0   0.0

In [321]:
mean_3712 = np.mean(df[3712])
mean_3712

4.5

In [322]:
# list_mean_weights 
column = [2824,3867,5062,442,3853]
mean_neighbors = []
for i in column:
    mean_neighbors.append(df_3712[i].mean())

In [323]:
mean_neighbors

[4.0588235294117645, 3.6615384615384614, 3.8656716417910446, 3.6, 3.7]

In [324]:
df_3712[2824].mean() # Testing

4.0588235294117645

In [325]:
df_3712_ratings.head() # attention this different than df_3712_rates

   2824  3867  5062  442   3853
0   4.5   4.0   4.0   3.0   NaN
1   NaN   4.0   4.0   NaN   NaN
2   5.0   4.5   4.5   3.0   3.5
3   NaN   NaN   4.5   4.0   NaN
4   4.5   4.0   4.0   1.0   NaN

In [326]:
df_3712_ratings_fillzero = df_3712_ratings.fillna(0)
df_3712_ratings_fillzero.head()

   2824  3867  5062  442   3853
0   4.5   4.0   4.0   3.0   0.0
1   0.0   4.0   4.0   0.0   0.0
2   5.0   4.5   4.5   3.0   3.5
3   0.0   0.0   4.5   4.0   0.0
4   4.5   4.0   4.0   1.0   0.0

In [327]:
from sklearn import preprocessing
import numpy as np
normalized= preprocessing.normalize(df_3712_ratings_fillzero)

In [328]:
norm = pd.DataFrame(normalized, columns =[2824,3867,5062,442,3853] )

In [329]:
norm.head()

       2824      3867      5062      442      3853
0  0.574989  0.511101  0.511101  0.383326  0.00000
1  0.000000  0.707107  0.707107  0.000000  0.00000
2  0.536828  0.483145  0.483145  0.322097  0.37578
3  0.000000  0.000000  0.747409  0.664364  0.00000
4  0.616670  0.548151  0.548151  0.137038  0.00000

In [330]:
def rate_mean_diff(df):
    rate_diff_100= []
    for i in range(100):
        l = list(df.iloc[i])
        rate_diff = []
        for j in range(5):
                rate_diff.append((l[j]-mean_neighbors[j]))
        rate_diff_100.append(rate_diff)
    return rate_diff_100

In [331]:
array = rate_mean_diff(df_3712_ratings_fillzero)

In [332]:
rate_diff = pd.DataFrame(array, columns =[2824,3867,5062,442,3853] )
rate_diff

        2824      3867      5062  442   3853
0   0.441176  0.338462  0.134328  -0.6  -3.7
1  -4.058824  0.338462  0.134328  -3.6  -3.7
2   0.941176  0.838462  0.634328  -0.6  -0.2
3  -4.058824 -3.661538  0.634328   0.4  -3.7
4   0.441176  0.338462  0.134328  -2.6  -3.7
..       ...       ...       ...   ...   ...
95 -4.058824 -0.661538 -0.365672  -3.6  -3.7
96 -4.058824  0.338462 -1.865672  -3.6  -3.7
97 -4.058824  0.338462  0.134328   0.4  -0.7
98 -4.058824 -0.161538 -3.865672   0.4  -3.7
99 -4.058824 -0.661538 -3.865672  -3.6  -3.7

[100 rows x 5 columns]

In [333]:
score = []
for i in range(100):
    score.append((rate_diff.iloc[i]*norm.iloc[i]).sum()/norm.iloc[i].sum() + 4.5)

<ipython-input-333-ad260ea3dcb9>:3: RuntimeWarning: invalid value encountered in double_scalars
  score.append((rate_diff.iloc[i]*norm.iloc[i]).sum()/norm.iloc[i].sum() + 4.5)

In [339]:
id_603 = df_3712[df_3712['Movie_Id'] == '603']

In [340]:

df_3712['Final_Score'] = score

<ipython-input-340-55ab51d6b462>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_3712['Final_Score'] = score

In [341]:
df_3712.sort_values(by= 'Final_Score', ascending  = False)

,2824,3867,5062,442,3853,Movie_Id,Movie_title,Final_Score
55,NaN,NaN,NaN,5.0,NaN,641,Requiem for a Dream (2000),5.900000
11,NaN,NaN,4.5,5.0,NaN,105,Back to the Future (1985),5.537313
50,5.0,5.0,4.5,5.0,4.5,603,The Matrix (1999),5.535528
15,4.0,5.0,4.5,5.0,5.0,121,The Lord of the Rings,5.470702
14,4.0,5.0,4.5,5.0,5.0,120,The Lord of the Rings,5.470702
...,...,...,...,...,...,...,...,...
32,NaN,NaN,NaN,NaN,NaN,275,Fargo (1996),NaN
45,NaN,NaN,NaN,NaN,NaN,581,Dances with Wolves (1990),NaN
62,NaN,NaN,NaN,NaN,NaN,786,Almost Famous (2000),NaN
92,NaN,NaN,NaN,NaN,NaN,9331,Clear and Present Danger (1994),NaN
93,NaN,NaN,NaN,NaN,NaN,9741,Unbreakable (2000),NaN